<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="?,3,640,640" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_3037_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="8, 3, 3, 3" offset="0" size="432" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3037">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_3037" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/backbone/model/conv_stem/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>640</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/conv_stem/Conv_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/backbone/model/act1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/model/act1/Relu_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="onnx::Conv_3040_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="432" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3040">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="onnx::Conv_3040" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_output_0,/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="onnx::Conv_3043_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="496" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3043">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="onnx::Conv_3043" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_1_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="onnx::Conv_3046_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="560" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3046">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="onnx::Conv_3046" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_rpr_conv.2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_2_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/primary_activation/Relu_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_388_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 1, 1" offset="624" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_388" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_scale/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_scale/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_22323_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 1, 1" offset="632" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_22323" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_23661" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_skip/BatchNormalization_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_3_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_449_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="640" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_449" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.0/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_4_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Reshape_509_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="712" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_509" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.1/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_5_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_569_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="784" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Reshape_569" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_rpr_conv.2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Add_6_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/cheap_activation/Relu_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/model/blocks_0/blocks_0.0/ghost1/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost1/Concat_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="onnx::Conv_3061_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="856" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3061">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="onnx::Conv_3061" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_output_0,/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_3064_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="920" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3064">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::Conv_3064" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_1_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="onnx::Conv_3067_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 8, 1, 1" offset="984" size="64" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3067">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="onnx::Conv_3067" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/primary_rpr_conv.2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_2_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Reshape_674_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 1, 1" offset="1048" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_674" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_scale/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_scale/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_22381_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 1, 1" offset="632" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_22381" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_23668" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_skip/BatchNormalization_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_3_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Reshape_735_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="1056" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_735" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.0/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_4_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_795_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="1128" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_795" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.1/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_5_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_855_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1, 1, 3, 3" offset="1200" size="72" />
			<output>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_855" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.2/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/cheap_rpr_conv.2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Add_6_output_0">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/backbone/model/blocks_0/blocks_0.0/ghost2/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>4</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/ghost2/Concat_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/model/blocks_0/blocks_0.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_0/blocks_0.0/Add_output_0">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="onnx::Conv_3082_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="12, 8, 1, 1" offset="1272" size="192" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3082">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_3082" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.0/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_output_0,/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="onnx::Conv_3085_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="12, 8, 1, 1" offset="1464" size="192" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3085">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Conv_3085" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.1/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_1_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_3088_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="12, 8, 1, 1" offset="1656" size="192" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_3088">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_3088" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>8</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_rpr_conv.2/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_2_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/primary_activation/Relu_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Reshape_961_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="12, 1, 1, 1, 1" offset="1848" size="24" />
			<output>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_961" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/backbone/model/blocks_1/blocks_1.0/ghost1/cheap_rpr_scale/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/cheap_rpr_scale/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_22439_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 12, 1, 1" offset="1872" size="24" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_22439" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_23675" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/cheap_rpr_skip/BatchNormalization_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/Add_3_output_0">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_1022_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="12, 1, 1, 3, 3" offset="1896" size="216" />
			<output>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_1022" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/model/blocks_1/blocks_1.0/ghost1/cheap_rpr_conv.0/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>12</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/model/blocks_1/blocks_1.0/ghost1/cheap_rpr_conv.0/conv/Conv_output_0">
					<dim>-1</dim>
					<dim>12</dim>
